{
  "architectures": [
    "LlamaForCausalLM"
  ],
  "bos_token_id": 1,
  "eos_token_id": 2,
  "hidden_act": "silu",
  "hidden_size": 4096,
  "initializer_range": 0.02,
  "intermediate_size": 11008,
  "max_position_embeddings": 1024,
  "model_type": "llama",
  "num_attention_heads": 32,
  "num_hidden_layers": 16,
  "pad_token_id": 0,
  "rms_norm_eps": 1e-6,
  "tie_word_embeddings": false,
  "torch_dtype": "float16",
  "transformers_version": "4.39.0",
  "use_cache": true,
  "vocab_size": 13000,
  "attention_dropout": 0.0,
  "dropout": 0.0,
  "attention_bias": false,
  "multiple_of": 32
}